# включити  < iostream >

struct  Date {
  int години;
  int хвилин;
};

використання  простору імен  std ;
int  main () {
  Дата date1;
  Дата date2;
  Дата SubDate;

  Знову:
  cout << " Введіть початкові роки: " ;
  cin >> дата1. години ;
  cout << " Введіть початкові хвилини: " ;
  cin >> дата1. хвилини ;
  cout << " Введіть кінцеві години: " ;
  cin >> дата2. години ;
  cout << " Введіть кінцеві хвилини: " ;
  cin >> дата2. хвилини ;
  

  якщо (дата1. години >= 24 || дата1. хвилини > 60 || дата2. години >= 24 || дата2. хвилини > 60 ){
    cout << " ---------------------------------------------- - \n " ;
    cout << " Введіть коректну дату \n " ;
    goto Знову;
  }
  
  Піддата. години = дата2. години - дата1. години ;
  Піддата. хвилини = дата2. хвилини - дата1. хвилини ;
  
  if (SubDate. hours < 0 ){
    Піддата. години = 24 + піддата. години ;
  }
  if (SubDate. minutes < 0 ){
    Піддата. хвилин = 60 + піддата. хвилини ;
    Піддата. години --;
  }

  if (SubDate. hours < 10 && SubDate. minutes > 10 ){
    cout << " 0 " << SubDate. години << " : " << Піддата. хвилини ;
  } else  if (SubDate. hours > 10 && SubDate. minutes < 10 ){
    cout << SubDate. години << " : " << " 0 " << Піддата. хвилини ;
  } else  if (SubDate. hours < 10 && SubDate. minutes < 10 ){
  cout << " 0 " << SubDate. години << " : " << " 0 " << Піддата. хвилини ;
  } ще {
    cout << SubDate. години << " : " << Піддата. хвилини ;
  }
  cout << endl;
  goto Знову;
}
